#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <limits.h>
#include <float.h>
//C:\Program Files\Microsoft Visual Studio\2022\Community\VC\Tools\MSVC\14.32.31326\include

//整数和浮点数的存储形式是有区别的：
//1.整数在内存中存储的是二进制补码，有大小端顺序
int main()
{
	INT_MAX;
	int n = 9;
	//9的二进制 00000000000000000000000000001001
	float* pFloat = (float*)&n;
	printf("n的值为：%d\n", n);
	                             //1.以浮点数视角取出
	printf("*pFloat的值为：%f\n", *pFloat); //0.000000  *pFloat解引用访问4个字节 是以浮点数角度看的 认为里面是浮点数
	//整型和浮点型在内存中存储方式和解读方式不一样
	        //整型和浮点型存进去和取出来的方式有区别   怎么存进去就怎么取出来  如果整型和浮点型存进去的方式不一样，那么整型和浮点型取出来的方式也不一样
	//浮点数角度0 00000000 00000000000000000001001
	//0.00000000000000000001001*2^(-126)         0.00000000000000000001001/(2^126)
	//0.000000



	//2.以浮点数视角存储9.0
	*pFloat = 9.0;
	//以浮点数形式放进去，再以n整数视角取出
	printf("n的值为：%d\n", n); //1091567616
	//1001.0
	//1.001*2^3
	//0 10000010 00100000000000000000000
	//整数视角打印 补码就是原码  1091567616
	printf("*pFloat的值为：%f\n", *pFloat); //9.000000


	//long double *pLongDouble = (long double*)&n;
	/*printf("*pLongDouble的值为：%lf\n", *pLongDouble);*/
	return 0;
}

//int main()
//{
//	/*float f = 5.5f;*/
//	//二进制    101.1
//	//科学计数  1.011*2^2
//	//    s=0  M=1.011  E=2
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	//40 b0 00 00
//
//	double f = 5.5f;
//	//1.011*2^2
//	//0100 0000 0001 0110 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000 0000
//	//40 16 00 00 00 00 00 00
//	return 0;
//}