#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//int main()
//{
//	/*int arr[10] = { 0 };
//	printf("%p\n", arr);
//	printf("%p\n", &arr[0]);*/
//
//	/*int arr[] = { 1,2,3,4,5,6,7,8,9,0 };
//	int* p = arr;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	for (int i = 0; i < sz; i++)
//	{
//		printf("&arr[%d] = %p <====> p+%d = %p\n", i, &arr[i], i, p + i);
//	}*/
//
//	//int arr[10] = { 0 };
//	//int* p = arr;
//	//int i = 0;
//	////初始化
//	//for (i = 0; i < 10; i++)
//	//{
//	//	/*printf("%p = %p\n", &arr[i], p + i);*/ //p是首元素地址  p+i产生的就是下标为i元素的地址
//	//	*(p + i) = i;
//	//	printf("%d ", *(p + i));
//
//	//}
//	//打印
//	/*for (i = 0; i < 10; i++)
//	{
//		printf("%d ", *(p + i));
//	}*/
//
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int* p = arr; //整型数组 数组名放到整型指针里 说明p=arr
//
//	//[]是一个操作符 2和arr是两个操作数
//	printf("%d\n", 2[arr]); //+2跳过两个元素 解引用才找到3
//	printf("%d\n", arr[2]); //arr[2] ==> *(arr + 2)  ==> *(2 + arr) ==> 2[arr]
//	printf("%d\n", p[2]); //p[2] ==> *(p + 2)  p+2跳过两个整型 跳过两个元素 解引用就是第三个元素
//	printf("%d\n", 2[p]); //2[p] ==> *(2 + p)
//
//	               //第三个元素的地址
//	//arr[2] <==> *(arr + 2) <==> *(p + 2) <==> *(2 + p) <==> *(2 + arr) == 2[arr]
//	             //下标为2     //加法支持交换律
//	//2[arr] == *(2 + arr)
//	return 0;
//}

//二级指针
////指针变量也是变量，是变量就有地址，那指针变量的地址存放在哪里？
//int main()
//{
//	int a = 10;
//	int* pa = &a; //pa是指针变量，一级指针 只有一层指向关系 pa指向了a
//	int** ppa = &pa; //pa也是变量 &pa取出pa在内存中的起始地址
//	    //ppa是一个二级指针 有两层指向关系 ppa指向了pa pa指向了a
//	int*** pppa = &ppa;
//
//	*ppa == pa;
//	*pa = a;
//	* *ppa = a; //对ppa解引用找到pa 对pa解引用找到a
//
//	*ppa = &a;
//	pa = &a;
//
//	**ppa = 10;
//	  *pa = 10;
//	    a = 10;
//	return 0;
//}

//指针数组 是数组，是存放指针的数组 就是指针数组
int main()
{
	int arr1[5]; //整型数组 - 存放整型的数组 就是整型数组 - 每个元素是个整型
	char arr2[6]; //字符数组 - 存放字符的数组 就是字符数组 - 每个元素是个字符
	int* parr[5]; //整型指针数组 - 存放整型指针的数组 - 每个元素是个整型指针
	char* pch[6]; //字符指针数组 - 存放字符指针的数组 - 每个元素是个字符指针

	int* arr3[5]; //arr3是一个整型指针数组，有5个元素，每个元素是一个整型指针
	return 0;
}