#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <assert.h>

//下面代码的结果是( )
/*int main()
{
	char a[1000] = { 0 };
	int i = 0;
	for (i = 0; i < 1000; i++)
	{
		a[i] = -1 - i;
	}
	printf("%d", strlen(a));
	return 0;
}   */               
                                      //2^8
//100000000000000000000001 00000000  -256原码
//111111111111111111111110 11111111  -256反码
//111111111111111111111111 00000000  -256补码

//字符串\0为结束标志  -1~-255
//                    -1      ~  -256
//                    -1~-128    127~0


//杨辉三角
//									  1
//									 1 1
//									1 2 1
//							       1 3 3 1
//								  1 4 6 4 1
//							    1 5 10 10 5 1
//							   1 6 15 20 15 6 1


//1
//1 1
//1 2 1
//1 3 3 1
//1 4 6 4 1
//1 5 10 10 5 1
//1 6 15 20 15 6 1

//#define ROW 7
//#define COL 7
//int main() 
//{
//	int arr[ROW][COL] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < ROW; i++)
//	{            //赋值仅到对角线
//		for (j = 0; j <= i; j++)
//		{  //第一列、对角线 初始化为1
//			if (j == 0 || i == j)
//			{
//				arr[i][j] = 1;
//			}
//			//此时除第一列、对角线 二维数组其余地方都为0
//			if (i >= 2 && j >= 1)
//			{
//				arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
//			}
//		}
//	}
//	for (i = 0; i < ROW; i++)
//	{//                有多少行，前面就空(行-1)格
//		for (j = 0; j < ROW - 1 - i; j++)
//		{
//			printf(" ");
//		}
//		          //到对角线 打印下三角
//		for (j = 0; j <= i; j++)
//		{  
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}

//打印菱形
//6     *
//5    **
//4   ***
//3  ****
//2 *****
//1******
//*******
//int main()
//{
//	int line = 0;
//	scanf("%d", &line);
//	int i = 0;
//	for (i = 0; i < line; i++)
//	{
//		int j = 0;
//		for (j = 0; j < line - 1 - i; j++)
//		{
//			printf(" ");
//		}
//		for (j = 0; j <2 * i + 1; j++)
//		{
//			printf("*");
//		}
//		printf("\n");
//	}
//	for (i = 0; i < line - 1; i++)
//	{
//		int j = 0;
//		for (j = 0; j <= i; j++)
//		{
//			printf(" ");
//		}
//		for (j = 0; j < 2 * (line - 1 - i) - 1; j++)
//		{
//			printf("*");
//		}
//		printf("\n");
//	}
//	return 0;
//}

//题目：猜凶手 日本某地发生了一起谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯中的一个。
//以下为四个嫌疑犯的供词：
//                             is A  is B  is C  is D
// A说：不是我。 killer != 'A'   X    √    √    √
// B说：是C。    killer == 'C'   X     X    √     X
// C说：是D。    killer == 'D'   X     X     X    √
// D说：C在胡说。killer != 'D'  √    √    √     X
// 
// 已知3个人说了真话，1个人说的是假话。
// 现在请根据这些信息，写一个程序来确定到底谁是凶手。
//int main()
//{
//	char killer = 'A';
//	for (killer = 'A'; killer <= 'D'; killer++)
//	{
//		if ((killer != 'A') + (killer == 'C') + (killer == 'D') + (killer != 'D') == 3)
//		{
//			printf("%c\n", killer);
//		}
//	}
//	return 0;
//}

//25匹马5条跑道找最快的3匹马，没有计时器，需要跑几次？答案：7
//
//首先进行分组：
//A1, A2, ..., A5;
//
//B1, B2, ..., B5;
//
//C1, C2, ..., C5;
//
//D1, D2, ..., D5;
//
//E1, E2, ..., E5;
//
//
//将25匹马分成ABCDE5组，比赛5次,假设每组的排名就是A1 > A2 > A3 > A4 > A5
//
//第6次，每组的第一名进行比赛，可以找出第一名最快的马，这里假设A1 > B1 > C1 > D1 > E1
//
//D1，E1肯定进不了前3，直接排除掉
//
//第7次，B1 C1 A2 B2 A3比赛，可以找出第二，第三名
//
//所以最少比赛需要7次

//题目：猜名次
//5名运动员参与了10米台跳水比赛，有人让他们预测比赛结果：
//A选手说：B第二，我第三
//B选手说：我第二，E第四
//C选手说：我第一，D第二
//D选手说：C最后，我第三
//E选手说：我第四，A第一
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。

int main()
{
	for (int a = 1; a <= 5; a++)
	{
		for (int b = 1; b <= 5; b++)
		{
			for (int c = 1; c <= 5; c++)
			{
				for (int d = 1; d <= 5; d++)
				{
					for (int e = 1; e <= 5; e++)
					{
						if (((b == 2) ^ (a == 3) == 1)
							&& ((b == 2) ^ (e == 4) == 1)
							&& ((c == 1) ^ (d == 2) == 1)
							&& ((c == 5) ^ (d == 3) == 1)
							&& ((e == 4) ^ (a == 1) == 1)
							&& (a * b * c * d * e == 120))
						{
							printf("a=%d b=%d c=%d d=%d e=%d", a, b, c, d, e);
						}
					}
				}
			}
		}
	}
	return 0;
}

